HiD/_posts/Perl/2013-01-02-create-schema-from-database.html
---
layout: tech-post
title: 从数据库自动生成DBIx::Class使用的Schema
category: Perl
change_frequency: monthly
tag: DBIx::Class
---


<p>
如果数据库和表已经存在，我们不需要手动创建Schema，可以使用 <a href="http://search.cpan.org/~rkitover/DBIx-Class-Schema-Loader-0.07033/lib/DBIx/Class/Schema/Loader.pm">DBIx::Class::Schema::Loader</a> 这个模块自动生成.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 从数据库产生Schema方法</a>
<ul>
<li><a href="#sec-1-1">1.1 使用 make_schema_at 方法</a></li>
<li><a href="#sec-1-2">1.2 使用 dbicdump 工具</a></li>
<li><a href="#sec-1-3">1.3 使用 dump_to_dir 方法</a></li>
</ul>
</li>
<li><a href="#sec-2">2 比较</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-4">
<h4 id="sec-1">从数据库产生Schema方法</h4>
<div class="outline-text-4" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-5">
<h5 id="sec-1-1">使用 make_schema_at 方法</h5>
<div class="outline-text-5" id="text-1-1">




<pre class="src src-sh">perl -MDBIx::Class::Schema::<span style="color: #ffffff; font-weight: bold;">Loader</span>=make_schema_at &lt;&lt;EOF
<span style="color: #ffa54f;">make_schema_at({</span>
<span style="color: #ffa54f;">   'My::Schema',</span>
<span style="color: #ffa54f;">   { debug =&gt;1, dump_directory =&gt; './'},</span>
<span style="color: #ffa54f;">   [ 'dbi:Pg:dbname="pesystem"','pesystem','pesystem_password' ],</span>
<span style="color: #ffa54f;">});</span>
<span style="color: #ffa54f;">EOF</span>
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-5">
<h5 id="sec-1-2">使用 dbicdump 工具</h5>
<div class="outline-text-5" id="text-1-2">

<p>   该工具其实内部使用了DBIx::Class::Schema::Loader模块. 
</p>


<pre class="src src-sh">dbicdump -o <span style="color: #ffffff; font-weight: bold;">dump_directory</span>=<span style="color: #ffff00;">'./'</span> My::Schema <span style="color: #ffff00;">'dbi:Pg:dbname="pesystem"'</span> <span style="color: #ffff00;">"pesystem"</span> <span style="color: #ffff00;">"pesystem_password"</span>
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-5">
<h5 id="sec-1-3">使用 dump_to_dir 方法</h5>
<div class="outline-text-5" id="text-1-3">

<p>   如果你的Schema模块已经写好，让模块继承DBIx::Class::Schema::Loader,然后执行:
</p>


<pre class="src src-perl"><span style="color: #ff0000;">#</span><span style="color: #ff0000;">My/Schema.pm</span>
pakcage My::Schema;
<span style="color: #00ffff;">use</span> <span style="color: #4186be;">base</span> <span style="color: #66cd00;">qw</span><span style="color: #ffff00;">/DBIx::Class::Schema::Loader/</span>;
1;

perl -MDBIx::Class::Schema::Loader=dump_to_dir:./ -MMy::Schema \
    <span style="color: #4186be;">-e</span> <span style="color: #ffff00;">'My::Schema-&gt;connection("dbi:Pg:dbname=pesystem","pesystem","pesystem_password")'</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">or</span><span style="text-decoration: underline;"> </span>
<span style="color: #00ffff;">use</span> <span style="color: #4186be;">My::Schema</span>;
My::Schema-&gt;dump_to_dir(<span style="color: #ffff00;">'./'</span>);
My::Schema-&gt;connection(...);
</pre>


<p>
   参见:<a href="http://search.cpan.org/~rkitover/DBIx-Class-Schema-Loader-0.07033/lib/DBIx/Class/Schema/Loader.pm#dump_to_dir">http://search.cpan.org/~rkitover/DBIx-Class-Schema-Loader-0.07033/lib/DBIx/Class/Schema/Loader.pm#dump_to_dir</a>
</p>
<p>
   继承DBIx::Class::Schema::Loader后，每次连接都会进行扫描数据库获取Schema.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">比较</h4>
<div class="outline-text-4" id="text-2">

<p>   dbicdump工具比较简单.
</p></div>
</div>
